# TODO: Написать программу "Зооферма", в которой будет создано несколько объектов класса Critter, а манипулировать
#   ими всеми можно будет с помощью списка. Теперь пользователь должен заботиться не об одной зверюшке, а обо всех
#   обитателях зоофермы. Вибирая пункт в меню, пользователь выбирает действие, которое хотел бы выполнить со всеми
#   зверюшками: покормить, поиграть или узнать об их самочуствии. Чтобы программа была интереснее, при создании каждой
#   зверюшки следует назначить ей случайно выбранные уровни голода и уныния.